In [4]:
import pandas as pd
from sqlalchemy import create_engine

# first read the file
df= pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv')

# clean the data
df.drop_duplicates(inplace=True)
df.dropna(inplace=True)
drop_columns=['EmployeeCount','StandardHours','Over18']
df.drop(columns=drop_columns,inplace=True,errors='ignore')

# create the database
engine=create_engine('sqlite:///hr_data.db')

# move the data from pandas to sql
df.to_sql('employees',con=engine,if_exists='replace',index=False)


pd.set_option('display.max_columns',None)
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,Female,94,3,2,Sales Executive,4,Single,5993,19479,8,Yes,11,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,Male,61,2,2,Research Scientist,2,Married,5130,24907,1,No,23,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,2396,6,Yes,15,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,Female,56,3,1,Research Scientist,3,Married,2909,23159,1,Yes,11,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,16632,9,No,12,3,4,1,6,3,3,2,2,2,2

In [ ]:
## Question 1: How many total employees are there?
q_total="SELECT COUNT(*) AS Total_Employees FROM employees"
total_df=pd.read_sql(q_total,con=engine)

print("the total employee count is: ")
total_df

the total employee count is:     Total_Employees
0             1470

In [11]:
## Question 2: What is the employee count for each department?
q_total_by_department="""SELECT Department, COUNT (*) AS Employee_count 
FROM employees GROUP BY Department"""
total_by_department_df=pd.read_sql(q_total_by_department,con=engine)


print("the total number of employees by each department:")
total_by_department_df

the total number of employees by each department:

               Department  Employee_count
0         Human Resources              63
1  Research & Development             961
2                   Sales             446

In [14]:
## Question 3: What is the average monthly income by job role?
q_income=""" SELECT JobRole, AVG(MonthlyIncome) AS Average_Income FROM employees 
GROUP BY JobRole"""
avg_income_df=pd.read_sql(q_income,con=engine)

print("the average income by job role:")
avg_income_df

the average income by job role:

                     JobRole  Average_Income
0  Healthcare Representative     7528.763359
1            Human Resources     4235.750000
2      Laboratory Technician     3237.169884
3                    Manager    17181.676471
4     Manufacturing Director     7295.137931
5          Research Director    16033.550000
6         Research Scientist     3239.972603
7            Sales Executive     6924.279141
8       Sales Representative     2626.000000

In [17]:
##  Question 4: Who are the top 5 employees by performance rate?
q_top_performance="""SELECT EmployeeNumber, Department, PerformanceRating FROM employees
ORDER BY PerformanceRating DESC LIMIT 5"""
top_performance_df=pd.read_sql(q_top_performance,con=engine)

print("the top 5 employees by performance rating: ")
top_performance_df

the top 5 employees by performance rating:

   EmployeeNumber              Department  PerformanceRating
0               2  Research & Development                  4
1              10  Research & Development                  4
2              11  Research & Development                  4
3              12  Research & Development                  4
4              27                   Sales                  4

In [20]:
## Question 5: Which department has the highest average performance rating?
q_top_department_performance=""" SELECT Department, AVG(PerformanceRating) AS Average_Performance_Rating_By_Department 
FROM employees
GROUP BY Department
ORDER BY PerformanceRating DESC
"""
top_avg_performance_df=pd.read_sql(q_top_department_performance,con=engine)

print("the highest average performance rating by department: ")
top_avg_performance_df

the highest average performance rating by department:

               Department  Average_Performance_Rating_By_Department
0  Research & Development                                  3.162331
1         Human Resources                                  3.142857
2                   Sales                                  3.136771

In [6]:
## Question 6: What is the average job satisfaction rate for each department?
q_job_Satisfaction=""" SELECT Department, AVG(JobSatisfaction) FROM employees
GROUP BY Department
ORDER BY JobSatisfaction DESC
"""
job_Satisfaction_df=pd.read_sql(q_job_Satisfaction,con=engine)

print("the average job satisfaction rate by department: ")
job_Satisfaction_df

the average job satisfaction rate by department:

               Department  AVG(JobSatisfaction)
0                   Sales              2.751121
1  Research & Development              2.726327
2         Human Resources              2.603175

In [7]:
## Question 7: Does working overtime affect the emplyees performance rate?
q_overtime=""" SELECT OverTime, AVG(PerformanceRating) AS Average_Performance
FROM employees
GROUP BY OverTime 
ORDER BY Average_Performance DESC"""
overtime_df=pd.read_sql(q_overtime,con=engine)

print("the average performance rating by overtime: ")
overtime_df

the average performance rating by overtime:

  OverTime  Average_Performance
0      Yes             3.156250
1       No             3.152751

In [29]:
## Question 8: What is the average Monthly Income for each gender?
q_avg_income_by_gender=""" SELECT Gender, AVG(MonthlyIncome) AS Average_Monthly_Income
FROM employees
GROUP BY Gender"""
avg_income_by_gender_df=pd.read_sql(q_avg_income_by_gender,con=engine)

print("average income for each gender: ")
avg_income_by_gender_df

average income for each gender:

   Gender  Average_Monthly_Income
0  Female             6686.566327
1    Male             6380.507937